nasa_api_viewer_backend/app/controllers/images_controller.rb

    def create
        #make new_image instance
        new_image = Image.new
        new_image.title = params["title"]#
        new_image.thumb_href = params["thumb_href"]#
        new_image.date_created= params["date_created"]#
        new_image.center= params["center"]#
        new_image.secondary_creator = params["secondary_creator"]
        new_image.media_type = params["media_type"]#
        new_image.nasa_id = params["nasa_id"]#
        new_image.keywords = params["keywords"]#
        new_image.description = params["description"]#
        new_image.href = params["href"]

        # new_image.med_href =
        # new_image.orig_href =

        #check if image already exists
        if Image.find_by(nasa_id: new_image.nasa_id)
            render_json(Image.find_by(nasa_id: new_image.nasa_id))
        else
            if new_image.save
---
SELECT "images".* FROM "images" WHERE "images"."nasa_id" = ? LIMIT ?  [["nasa_id", "PIA20917"], ["LIMIT", 1]]
SELECT "images".* FROM "images" WHERE "images"."nasa_id" = ? LIMIT ?  [["nasa_id", "PIA18249"], ["LIMIT", 1]]
INSERT INTO "images" ("title", "created_at", "updated_at", "date_created", "center", "nasa_id", "keywords", "description", "thumb_href", "href") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)